Repository: movieshark/NotYet
Catalog: plugin.video.notyet/resources/language/resource.language.*/strings.po
Languages: hu_hu

# #30001
source: General
hu_hu: Általános

# #30002
source: Advanced
hu_hu: Haladó

# #30003
source: Account
hu_hu: Fiók

# #30004
source: Request details
hu_hu: Hálózati kérések adatai

# #30005
source: Read-only data
hu_hu: Csak olvasható adatok

# #30006
source: Username
hu_hu: Felhasználónév

# #30007
source: Password
hu_hu: Jelszó

# #30009
source: App version
hu_hu: App verzió

# #30010
source: Display tokens?
hu_hu: Tokenek megjelenítése?

# #30011
source: Device's unique ID
hu_hu: Eszköz egyedi azonosítója

# #30012
source: OAuth Access Token
hu_hu: OAuth hozzáférési token

# #30013
source: OAuth Refresh Token
hu_hu: OAuth frissítő token

# #30014
source: OAuth Access Token Expiry
hu_hu: OAuth hozzáférési token lejárata

# #30016
source: KS Refresh Token
hu_hu: KS frissítő token

# #30017
source: KS Token Expiry
hu_hu: KS token lejárata

# #30018
source: Yeti TV username
hu_hu: Yeti TV felhasználónév

# #30019
source: Yeti TV password
hu_hu: Yeti TV jelszó

# #30020
source: Leave blank to let the addon generate a random one
hu_hu: Hagyd üresen, hogy az addon generáljon egy véletlenszerűt

# #30021
source: Library
hu_hu: Könyvtár

# #30022
source: Sort list items by ABC order
hu_hu: Listaelemek rendezése ABC sorrendben

# #30023
source: List all channels (on) / subscribed only (off - query doesn't exist in official app!)
hu_hu: Összes csatorna listázása (be) / csak előfizetett (ki - a hivatalos appban nincs ilyen lekérdezés!)

# #30024
source: Hide adult content
hu_hu: Felnőtt tartalom elrejtése

# #30025
source: Device nick (official app sets this empty)
hu_hu: Eszköz beceneve (a hivatalos app üresen hagyja)

# #30026
source: Update
hu_hu: Frissítés

# #30027
source: Requesting OAuth access token...
hu_hu: OAuth hozzáférési token lekérése...

# #30028
source: Refreshing KS token...
hu_hu: KS token frissítése...

# #30029
source: Anonym login...
hu_hu: Anonim bejelentkezés...

# #30030
source: Requesting KS token...
hu_hu: KS token lekérése...

# #30031
source: Registering device...
hu_hu: Eszköz regisztrálása...

# #30032
source: We got back another device ID than our own! Try to delete the device ID!
hu_hu: Más eszközazonosítót kaptunk, mint a sajátunk! Próbáld törölni az eszközazonosítót!

# #30033
source: Successful login!
hu_hu: Sikeres bejelentkezés!

# #30034
source: Channels
hu_hu: Csatornák

# #30035
source: Delete device ID
hu_hu: Eszközazonosító törlése

# #30036
source: Deletes the cached login data such as tokens and generates a new device ID.
hu_hu: Törli a gyorsítótárban tárolt bejelentkezési adatokat, mint például a tokeneket, és létrehoz egy új eszközazonosítót.

# #30037
source: Reset cached login data
hu_hu: Gyorsítótárazott belépési adatok törlése

# #30038
source: Resets the cached login data such as tokens. Doesn't touch the device ID or the entered username, password and the addon settings.
hu_hu: Alaphelyzetbe állítja a gyorsítótárazott bejelentkezési adatokat, mint például a tokeneket. Nem törli az eszközazonosítót, a megadott felhasználónevet, jelszót és a kiegészítő egyéb beállításait.

# #30039
source: Settings
hu_hu: Beállítások

# #30040
source: The addon's settings.
hu_hu: A kiegészítő beállításai.

# #30041
source: You don't have permission to view this content.
hu_hu: Nincs jogosultságod a tartalom megtekintéséhez.

# #30042
source: Not playable content.
hu_hu: Nem lejátszható tartalom.

# #30043
source: Content is DRM protected, but no Widevine license URL found in the API response.
hu_hu: A tartalom DRM-védelem alatt áll, de nincs Widevine licenc URL az API válaszban.

# #30044
source: No URL to the media was found in the API response.
hu_hu: Nem található média URL az API válaszban.

# #30045
source: Widevine CDM not found. Playback of DRM protected content won't be possible.
hu_hu: Nincs telepítve Widevine CDM. DRM-védett tartalmak lejátszása nem lehetséges.

# #30046
source: First login in settings!
hu_hu: Először jelentkezz be a beállításokban!

# #30047
source: Recordings
hu_hu: Felvételek

# #30048
source: Delete recording
hu_hu: Felvétel törlése

# #30049
source: Are you sure you want to delete this recording? [B]There is no way to restore it! Unless you remember its recording ID.[/B]
hu_hu: Biztosan törölni szeretnéd ezt a felvételt? [B]Nincs mód visszaállítására, hacsak nem emlékszel a felvétel azonosítójára![/B]

# #30050
source: Deletion successful!
hu_hu: Törlés sikeres!

# #30051
source: Unknown API response: {response}
hu_hu: Ismeretlen API válasz: {response}

# #30052
source: Recording was started at
hu_hu: Felvétel kezdete

# #30053
source: Recording was stopped at
hu_hu: Felvétel vége

# #30054
source: Recording can be watched until
hu_hu: Felvétel megtekinthető

# #30055
source: Playback
hu_hu: Lejátszás

# #30056
source: Prefer hungarian audio when available
hu_hu: Magyar hangra váltás, ha elérhető

# #30057
source: Device list
hu_hu: Eszközök listája

# #30058
source: Device activated at
hu_hu: Eszköz aktiválva

# #30059
source: Device last used at
hu_hu: Eszköz utoljára használva

# #30060
source: Household ID
hu_hu: Háztartás azonosító

# #30061
source: State
hu_hu: Állapot

# #30062
source: Delete device
hu_hu: Eszköz törlése

# #30063
source: Are you sure you want to delete this device? [B]There is no way to restore it![/B]
hu_hu: Biztosan törölni szeretnéd ezt az eszközt? [B]Nincs mód a visszaállítására![/B]

# #30064
source: [B]This device[/B]
hu_hu: [B]Ez az eszköz[/B]

# #30065
source: Movies
hu_hu: Filmek

# #30066
source: Next page
hu_hu: Következő oldal

# #30067
source: Documentaries
hu_hu: Dokumentumfilmek

# #30068
source: Series
hu_hu: Sorozatok

# #30069
source: Starts at
hu_hu: Kezdés

# #30070
source: Household ID
hu_hu: Háztartás azonosító

# #30071
source: User ID
hu_hu: Felhasználó azonosító

# #30072
source: Obtaining household ID & user ID...
hu_hu: Háztartás azonosító és felhasználó azonosító lekérése...

# #30073
source: Playing
hu_hu: Lejátszás aktív

# #30074
source: Type
hu_hu: Típus

# #30075
source: Issue with the data extraction. Won't report playback status to the server.
hu_hu: Probléma a lejátszás adatainak kinyerésével. Nem jelentem a lejátszás állapotát a szervernek.

# #30076
source: You've reached the maximum concurrent playback limit.
hu_hu: Elérted a maximális egyidejű lejátszási korlátot.

# #30077
source: Export
hu_hu: Exportálás

# #30078
source: Channel list path
hu_hu: Csatornalista útvonala

# #30079
source: Channel list name
hu_hu: Csatornalista neve

# #30080
source: Export channel list
hu_hu: Csatornalista exportálása

# #30081
source: Couldn't export the channel list. Invalid path or name?
hu_hu: Nem sikerült exportálni a csatornalistát. Érvénytelen útvonal vagy név?

# #30082
source: Login first!
hu_hu: Először jelentkezz be!

# #30083
source: Successfully exported the channel list!
hu_hu: Sikeres csatornaexportálás!

# #30085
source: EPG file name
hu_hu: EPG fájl neve

# #30086
source: Request EPG from (days)
hu_hu: EPG lekérése ettől a naptól

# #30087
source: Request EPG to (days)
hu_hu: EPG lekérése eddig a napig

# #30088
source: EPG update frequency
hu_hu: EPG frissítési gyakorisága

# #30089
source: 3 hours
hu_hu: 3 óra

# #30090
source: 6 hours
hu_hu: 6 óra

# #30091
source: 12 hours
hu_hu: 12 óra

# #30092
source: 24 hours
hu_hu: 24 óra

# #30093
source: 48 hours
hu_hu: 48 óra

# #30094
source: 72 hours
hu_hu: 72 óra

# #30095
source: Export EPG
hu_hu: EPG exportálása

# #30096
source: EPG export successful!
hu_hu: EPG exportálás sikeres!

# #30097
source: Last EPG update
hu_hu: Utolsó EPG frissítés

# #30098
source: Auto update EPG
hu_hu: EPG automatikus frissítése

# #30099
source: EPG update interval is not set.
hu_hu: Nem indult el az EPG frissítés, mert nincs beállítva az időintervallum.

# #30100
source: EPG update
hu_hu: EPG frissítés

# #30101
source: Player reporting (on by default, disable only for debugging)
hu_hu: Lejátszás jelentés (alapból: be, csak hibakereséshez kapcsold ki)

# #30102
source: Give up after (tries)
hu_hu: Próbálkozások száma

# #30103
source: Path
hu_hu: Elérési útvonal

# #30104
source: App version with build (ie. 1.23.0-PC)
hu_hu: App verzió és build (pl. 1.23.0-PC)

# #30105
source: Platform (ie. other)
hu_hu: Platform (pl. other)

# #30106
source: Device Brand (ie. 22)
hu_hu: Eszköz márkája (pl. 22)

# #30107
source: Device Family (ie. 5)
hu_hu: Eszköz termékcsaládja (pl. 5)

# #30108
source: Firmware (ie. n/a)
hu_hu: Firmware (pl. n/a)

# #30109
source: Partner ID (ie. 3204)
hu_hu: Partner azonosító (pl. 3204)

# #30110
source: TV PIL version (ie. 1.14.0)
hu_hu: TV PIL verzió (pl. 1.14.0)

# #30111
source: Special User-Agent (ie. JSClient/2.24.2)
hu_hu: Speciális User-Agent (pl. JSClient/2.24.2)

# #30112
source: Realm (ie. sc-acc-prod)
hu_hu: Realm (pl. sc-acc-prod)

# #30113
source: API version (ie. 5.4.0)
hu_hu: API verzió (pl. 5.4.0)

# #30114
source: OTT Username (ie. 11111)
hu_hu: OTT felhasználónév (pl. 11111)

# #30115
source: OTT Password (ie. 11111)
hu_hu: OTT jelszó (pl. 11111)

# #30116
source: Channel type (ie. 613)
hu_hu: Csatorna típusa (pl. 613)

# #30117
source: DRM API version (ie. 7.8.1)
hu_hu: DRM API verzió (pl. 7.8.1)

# #30118
source: DRM Client Tag (ie. html5:v7.56)
hu_hu: DRM kliens címke (pl. html5:v7.56)

# #30119
source: Movies ID (ie. 357915)
hu_hu: Filmek azonosítója (pl. 357915)

# #30120
source: Don't touch settings here unless instructed otherwise!
hu_hu: Ne módosítsd ezeket a beállításokat, hacsak nem kaptál erre utasítást!

# #30121
source: The completion of the add-on was made possible by paying the fee of the highest subscription and weeks of research work. Therefore, please [B]read the following carefully[/B]! If something is unclear, this text can be accessed at any time from the 'About' section in the add-on's main menu. Also, feel free to ask questions on the forum. ;) 1. By logging into the add-on, you automatically accept the Terms and Conditions of the underlying platform and agree to abide by them. This add-on was created independently of the mentioned platform for the purpose of studying it. I do not recommend its use to anyone, and I am not taking any responsibility for any potential damage! 2. The add-on requires the latest Widevine CDM and inputstream.adaptive add-ons to function properly, as well as a device with Widevine L3 certification at the time of release. The add-on will make every effort to verify and install these components if necessary. However, resolving any resulting errors (such as playback not starting) is the user's responsibility. 3. Initially, I wanted to address the service provider exactly as their own applications do, but I quickly realized that doing so would make the add-on slow and data consumer. Therefore, most requests made from the add-on are optimized for Kodi and based on educated guesses. As a result, certain features, such as search or displaying the current program list under the channels menu, are not implemented. If optimal solutions are found for these, they will also be developed. 4. The add-on relies on the goodwill of the user. Therefore, it may not necessarily provide feedback in case of intentionally providing incorrect data if something goes wrong. The reasons for this are twofold: firstly, it is not possible to prepare for all possibilities as the platform is closed; secondly, handling these cases would significantly slow down the user experience. I kindly ask everyone to provide meaningful data. 5. The advanced settings of the add-on do not need to be modified by default, and it is not recommended to do so. Please only make changes if you have a good reason and are confident in the correctness of the modification, or if recommended by the developer. A good example of this is when a new version appears in the application but no add-on update is available with the new version number. In such cases, you can override it. 6. Most of the add-on's settings take effect after restarting Kodi or disabling and re-enabling the add-on. I recommend doing this after every change. The only exception is the 'device name' setting, which takes effect only after deleting the device identifier and re-logging. 7. The add-on can be used on its own, but for displaying the EPG, the iptvsimple PVR add-on can also be used. This functionality is currently in beta. If you want to use it, first log in, make sure you can play content with the add-on's built-in channel list (this step is mandatory for obtaining the token), then go to the add-on settings. Here, in the 'Export' tab, you will find all the relevant settings. First, provide the path where the channel list and EPG will be saved. Make sure the path is writable and has enough space (usually 20 MiB is enough). Then, enter the channel list name (arbitrary) and save the changes. Open the settings again and go to the 'Export' tab, then choose the 'Export Channel List' option. If this is successful, enter the EPG file name, set how many days of EPG you want to retrieve retrospectively and in advance, specify the update frequency, and the number of retry attempts in case of failed attempts. Save the settings and restart Kodi. If everything goes well, the add-on will automatically start downloading the EPG when Kodi starts (if the specified time interval has expired, automatic download is enabled, and we are logged in). The success of the process will always be indicated by a silent notification, which can take minutes. The resulting files can be imported into the IPTV Simple add-on. 8. The add-on supports both Hungarian and English languages. If Kodi starts in English, the add-on will also be in English. I welcome translations into other languages (if you see the need). 9. The add-on is not prepared for the scenario where you are logged out of the platform or another registered device on the platform logs you out due to reasons beyond your control. In such cases, it may encounter errors. Please make sure that your subscription is active, the official applications are working, and you have not exceeded the allowed device limit before reporting an error. It is recommended to delete cached login data, and if that doesn't solve the issue, use the option to delete the device identifier, which attempts to log in again and register the device. 10. Recording is currently only possible if you enable the IPTV Simple integration. You may record simply by long pressing on a channel and choosing play program or using the following method: The EPG description will contain the recording ID in brackets. If the ID starts with a '!' sign, you may not record that program. Remember the ID and enter it in the addon's main menu to setup a recording. Upon entering you will get a confirmation whether the recording was successfully initiated or not. There is no obstacle to viewing recordings initiated from the official app. Thank you for reading, and enjoy!
hu_hu: A kiegészítő elkészültét a legnagyobb előfizetés díja, illetve hetek kutatással töltött munkája tette lehetővé. Ezáltal kérlek, hogy [B]az alábbiakat figyelmesen olvasd el[/B]! Ha valami nem lenne világos, a kiegészítő főmenüjében 'A kiegészítőről' menüpont alól előhozható bármikor ez a szöveg. Illetve kérdezni a fórumon ér. ;) 1. A kiegészítőbe való bejelentkezéssel automatikusan elfogadod a mögöttes platform ÁSZF-jét és betartod azt. Ezen kiegészítő a nevezett platformtól függetlenül, a platform tanulmányozása céljából jött létre. Használatát senkinek nem ajánlom és az esetleges károkért felelősséget nem válalok! 2. A kiegészítő megfelelő működéséhez a legfrissebb Widevine CDM és az inputstream.adaptive kiegészítő megléte szükséges, valamint a kiadás pillanatában egy Widevine L3 minősítésű eszköz. A kiegészítő megtesz mindent annak érdekében, hogy ennek meglétét ellenőrizze, illetve szükség esetén telepítse. De az ebből fakadó hibák (lejátszás nem indul stb) megoldása a felhasználó feladata. 3. Eredetileg szerettem volna pontosan úgy megszólítani a szolgáltatót, ahogyan azt az ő alkalmazásaik is teszik, azonban hamar rájöttem, hogy ha ezt tenném, akkor a kiegészítő lassú lenne és rengeteg adatot használna el. Ezért a kiegészítőből végzett kérések nagyrésze Kodira optimalizált, tippelésen alapul. Éppen ezért bizonyos funkciók, mint a keresés, vagy az éppen aktuális műsorlista megjelenítése a csatornák menü alatt nincs megoldva. Ha sikerül ezekre optimális megoldást találni, akkor ezek is lefejlesztésre kerülnek. 4. A kiegészítő bízik a felhasználó jóindulatában. Azaz szándékosan helytelen adatok megadása esetén nem feltétlen jelez vissza, ha valami félremegy. Ennek oka egyrészt, hogy minden eshetőségre nem lehet felkészülni, hiszen a platform zárt, másrészt ezek kezelése jelentősen lassítana a felhasználói élményen. Kérem, hogy értelmes adatokkal próbálkozzon mindenki. 5. A kiegészítő haladó beállításait alap esetben nem szükséges állítani és nem is ajánlott. Kérem, hogy csak akkor módosítsd, ha jó okod van rá és magabiztos vagy a változtatás helyességében. Illetve ha a fejlesztő javasolja. Egy jó példa erre, ha az alkalmazásból megjelenik egy új verzió, de nem érkezik kiegészítő frissítés a friss verziószámmal. Ilyen esetben át lehet írni. 6. A kiegészítő beállításainak nagy része Kodi újraindítást, vagy a kiegészítő letiltását, majd újbóli engedélyezését követően lép érvénybe. Javaslom ezt eszközölni minden változtatás után. Kivétel ez alól az 'eszköz neve' beállítás, mely az eszköz azonosítójának törlését és az újbóli belépést követően lép csak érvénybe. 7. A kiegészítő használható önmagában is, azonban az EPG megjelenítésére használható az iptvsimple PVR kiegészítő is. Ez a funkcio egyelőre béta. Amennyiben használni szeretnéd, először jelentkezz be, győződj meg arról, hogy le tudsz-e játszani a kiegészítő beépített csatornalistájával tartalmakat (ez a lépés kötelező token beszerzése miatt) majd lépj be a kiegészítő beállításaiba. Itt az 'Exportálás' fülön találod az összes ide vonatkozó beállítást. Először add meg az elérési utat, ahova a csatornalista és az EPG mentve lesz. Győződj meg róla, hogy írható az útvonal és van elég hely rajta (ált. 20 MiB elég). Ezt követően add meg a csatornalista nevét (tetszőleges), majd mentsd le a változtatásokat és nyisd meg újra a beállításokat. Menj az 'Exportálás' fülre ismét és a 'Csatornalista exportálása' opcióra. Ha ez sikeres, akkor add meg az EPG fájl nevét is, állítsd be, hogy hány napra visszamenőleg szeretnéd lekérni az EPG-t, illetve hány napra előre, add meg frissítés gyakoriságát, illetve a sikertelen próbálkozások esetén újrapróbálkozások számát is. Majd mentsd el a beállításokat és indítsd újra a Kodit. Ha minden jól megy, a kiegészítő a Kodi indulásával automatikusan megkezdi az EPG letöltését (amennyiben lejárt a meghatározott időintervallum és engedélyezve van az automatikus letöltés, illetve be vagyunk lépve). A folyamat sikerességéről mindig egy csendes értesítés fog tájékoztatni és percekbe is telhet. A kész fájlokat lehet importálni az IPTV Simple kiegészítőbe. 8. A kiegészítő tud magyarul és angolul is. Ha a Kodi angol nyelven indul, akkor a kiegészítő is. Egyéb nyelvű fordításokat szívesen várok (ha látod értelmét). 9. A kiegészítő nincs felkészítve arra az eshetőségre, ha önhibáján kívül jelentkezteti ki a platform, vagy a platformra regisztrált másik eszköz, így ebben az esetben hibára futhat. Kérem, hogy mielőtt hibát jelentenél, győződj meg arról, hogy az előfizetésed aktív, működik a hivatalos alkalmazásokban és nem lépted túl a megengedett eszköz limitet. Javasolt az gyorsítótárazott belépési adatok törlése, illetve ha ez sem oldja meg, akkor az eszközazonosító törlése opció használata, ami megkísérli az újra belépést, illetve az eszköz regisztrációját. 10. Felvételek rögzítése egyelőre csak az IPTV Simple integráció engedélyezésével lehetséges. A felvétel elindítható a műsorra hosszú nyomással, majd a műsor lejátszása gombot kiválasztva, vagy a következő módon: Az EPG leírás tartalmazni fogja a felvétel azonosítóját zárójelek között. Amennyiben a felvételazonosító '!' szimbólummal kezdődik, úgy az adott műsort nem lehetséges felvenni. Jegyezd meg az azonosítót és írd be a főmenü rögzítés ablakába. Miután beírtad, kapsz egy megerősítést, hogy a rögzítés elindítása sikeres volt-e. A hivatalos appból indított felvételek megtekintésének semmi akadálya. Köszönöm, hogy elolvastad és jó szórakozást!

# #30122
source: About
hu_hu: A kiegészítőről

# #30123
source: First run?
hu_hu: Első indítás?

# #30124
source: Add recording ID to EPG description
hu_hu: Felvétel azonosító hozzáadása az EPG leírásához

# #30125
source: Add recording
hu_hu: Felvétel hozzáadása

# #30126
source: Enter the recording ID (find it in the EPG description)
hu_hu: Add meg a felvétel azonosítóját (az EPG leírásában található)

# #30127
source: Recording successfully added!
hu_hu: Felvétel sikeresen hozzáadva!

# #30128
source: The provided recording ID doesn't exist!
hu_hu: A megadott felvétel azonosító nem létezik!

# #30129
source: This program cannot be recorded!
hu_hu: Ezt a műsort nem lehet felvenni!

# #30130
source: Notification on EPG fetch completion
hu_hu: Értesítés az EPG letöltés befejeztekor

# #30131
source: The item was previously recorded. Added to your recording library!
hu_hu: A műsort már felvettük. Hozzáadva a felvételekhez!

# #30132
source: This title will be played in the future. Do you wish to record it?
hu_hu: Ez a műsor még nem kezdődött el. Szeretnéd felvenni?

# #30133
source: This title is currently playing. Do you wish to set a recording or do you wish to start watching?
hu_hu: Ez a műsor éppen élőben megy. Szeretnéd felvenni, vagy inkább megnéznéd?

# #30134
source: Record it!
hu_hu: Felvétel!

# #30135
source: Watch it!
hu_hu: Megnézem!

# #30136
source: Nevermind
hu_hu: Mégsem
